Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim8.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32L4R5_tim8 equates.
 */

#pragma once

#include    <stdint.h>

// TIM8 address definitions
// ------------------------

typedef struct {
    volatile    uint16_t    CR1;
    volatile    uint16_t    RESERVED0;
    volatile    uint32_t    CR2;
    volatile    uint32_t    SMCR;
    volatile    uint16_t    DIER;
    volatile    uint16_t    RESERVED1;
    volatile    uint32_t    SR;
    volatile    uint16_t    EGR;
    volatile    uint16_t    RESERVED2;
        union {
    volatile    uint32_t    CCMR1;
    volatile    uint32_t    CCMR1_ALTERNATE;
        };
        union {
    volatile    uint32_t    CCMR2;
    volatile    uint32_t    CCMR2_ALTERNATE;
        };
    volatile    uint32_t    CCER;
    volatile    uint32_t    CNT;
    volatile    uint16_t    PSC;
    volatile    uint16_t    RESERVED3;
    volatile    uint16_t    ARR;
    volatile    uint16_t    RESERVED4;
    volatile    uint16_t    RCR;
    volatile    uint16_t    RESERVED5;
    volatile    uint16_t    CCR1;
    volatile    uint16_t    RESERVED6;
    volatile    uint16_t    CCR2;
    volatile    uint16_t    RESERVED7;
    volatile    uint16_t    CCR3;
    volatile    uint16_t    RESERVED8;
    volatile    uint16_t    CCR4;
    volatile    uint16_t    RESERVED9;
    volatile    uint32_t    BDTR;
    volatile    uint16_t    DCR;
    volatile    uint16_t    RESERVED10;
    volatile    uint32_t    DMAR;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    CCMR3;
    volatile    uint32_t    CCR5;
    volatile    uint16_t    CCR6;
    volatile    uint16_t    RESERVED12;
    volatile    uint32_t    AF1;
    volatile    uint32_t    AF2;
    volatile    uint32_t    TISEL;
} TIM8_TypeDef;

#ifdef __cplusplus
#define TIM8    reinterpret_cast<TIM8_TypeDef *>(0x40013400U)

#else
#define TIM8    ((TIM8_TypeDef *)0x40013400U)
#endif

// CR1 Configuration

#define TIM8_CR1_UIFREMAP                   (0x1U<<11U)
#define TIM8_CR1_CKD                        (0x3U<<8U)
#define TIM8_CR1_CKD_0                      (0x1U<<8U)
#define TIM8_CR1_ARPE                       (0x1U<<7U)
#define TIM8_CR1_CMS                        (0x3U<<5U)
#define TIM8_CR1_CMS_0                      (0x1U<<5U)
#define TIM8_CR1_DIR                        (0x1U<<4U)
#define TIM8_CR1_OPM                        (0x1U<<3U)
#define TIM8_CR1_URS                        (0x1U<<2U)
#define TIM8_CR1_UDIS                       (0x1U<<1U)
#define TIM8_CR1_CEN                        (0x1U<<0U)
#define TIM8_CR1_UIFREMAP_B_0X0             (0x0U<<11U)
#define TIM8_CR1_UIFREMAP_B_0X1             (0x1U<<11U)
#define TIM8_CR1_CKD_B_0X0                  (0x0U<<8U)
#define TIM8_CR1_CKD_B_0X1                  (0x1U<<8U)
#define TIM8_CR1_CKD_B_0X2                  (0x2U<<8U)
#define TIM8_CR1_CKD_B_0X3                  (0x3U<<8U)
#define TIM8_CR1_ARPE_B_0X0                 (0x0U<<7U)
#define TIM8_CR1_ARPE_B_0X1                 (0x1U<<7U)
#define TIM8_CR1_CMS_B_0X0                  (0x0U<<5U)
#define TIM8_CR1_CMS_B_0X1                  (0x1U<<5U)
#define TIM8_CR1_CMS_B_0X2                  (0x2U<<5U)
#define TIM8_CR1_CMS_B_0X3                  (0x3U<<5U)
#define TIM8_CR1_DIR_B_0X0                  (0x0U<<4U)
#define TIM8_CR1_DIR_B_0X1                  (0x1U<<4U)
#define TIM8_CR1_OPM_B_0X0                  (0x0U<<3U)
#define TIM8_CR1_OPM_B_0X1                  (0x1U<<3U)
#define TIM8_CR1_URS_B_0X0                  (0x0U<<2U)
#define TIM8_CR1_URS_B_0X1                  (0x1U<<2U)
#define TIM8_CR1_UDIS_B_0X0                 (0x0U<<1U)
#define TIM8_CR1_UDIS_B_0X1                 (0x1U<<1U)
#define TIM8_CR1_CEN_B_0X0                  (0x0U<<0U)
#define TIM8_CR1_CEN_B_0X1                  (0x1U<<0U)

// CR2 Configuration

#define TIM8_CR2_MMS2                       (0xFU<<20U)
#define TIM8_CR2_MMS2_0                     (0x1U<<20U)
#define TIM8_CR2_OIS6                       (0x1U<<18U)
#define TIM8_CR2_OIS5                       (0x1U<<16U)
#define TIM8_CR2_OIS4                       (0x1U<<14U)
#define TIM8_CR2_OIS3N                      (0x1U<<13U)
#define TIM8_CR2_OIS3                       (0x1U<<12U)
#define TIM8_CR2_OIS2N                      (0x1U<<11U)
#define TIM8_CR2_OIS2                       (0x1U<<10U)
#define TIM8_CR2_OIS1N                      (0x1U<<9U)
#define TIM8_CR2_OIS1                       (0x1U<<8U)
#define TIM8_CR2_TI1S                       (0x1U<<7U)
#define TIM8_CR2_MMS                        (0x7U<<4U)
#define TIM8_CR2_MMS_0                      (0x1U<<4U)
#define TIM8_CR2_CCDS                       (0x1U<<3U)
#define TIM8_CR2_CCUS                       (0x1U<<2U)
#define TIM8_CR2_CCPC                       (0x1U<<0U)
#define TIM8_CR2_MMS2_B_0X0                 (0x0U<<20U)
#define TIM8_CR2_MMS2_B_0X1                 (0x1U<<20U)
#define TIM8_CR2_MMS2_B_0X2                 (0x2U<<20U)
#define TIM8_CR2_MMS2_B_0X3                 (0x3U<<20U)
#define TIM8_CR2_MMS2_B_0X4                 (0x4U<<20U)
#define TIM8_CR2_MMS2_B_0X5                 (0x5U<<20U)
#define TIM8_CR2_MMS2_B_0X6                 (0x6U<<20U)
#define TIM8_CR2_MMS2_B_0X7                 (0x7U<<20U)
#define TIM8_CR2_MMS2_B_0X8                 (0x8U<<20U)
#define TIM8_CR2_MMS2_B_0X9                 (0x9U<<20U)
#define TIM8_CR2_MMS2_B_0XA                 (0xAU<<20U)
#define TIM8_CR2_MMS2_B_0XB                 (0xBU<<20U)
#define TIM8_CR2_MMS2_B_0XC                 (0xCU<<20U)
#define TIM8_CR2_MMS2_B_0XD                 (0xDU<<20U)
#define TIM8_CR2_MMS2_B_0XE                 (0xEU<<20U)
#define TIM8_CR2_MMS2_B_0XF                 (0xFU<<20U)
#define TIM8_CR2_OIS1N_B_0X0                (0x0U<<9U)
#define TIM8_CR2_OIS1N_B_0X1                (0x1U<<9U)
#define TIM8_CR2_OIS1_B_0X0                 (0x0U<<8U)
#define TIM8_CR2_OIS1_B_0X1                 (0x1U<<8U)
#define TIM8_CR2_TI1S_B_0X0                 (0x0U<<7U)
#define TIM8_CR2_TI1S_B_0X1                 (0x1U<<7U)
#define TIM8_CR2_MMS_B_0X0                  (0x0U<<4U)
#define TIM8_CR2_MMS_B_0X1                  (0x1U<<4U)
#define TIM8_CR2_MMS_B_0X2                  (0x2U<<4U)
#define TIM8_CR2_MMS_B_0X3                  (0x3U<<4U)
#define TIM8_CR2_MMS_B_0X4                  (0x4U<<4U)
#define TIM8_CR2_MMS_B_0X5                  (0x5U<<4U)
#define TIM8_CR2_MMS_B_0X6                  (0x6U<<4U)
#define TIM8_CR2_MMS_B_0X7                  (0x7U<<4U)
#define TIM8_CR2_CCDS_B_0X0                 (0x0U<<3U)
#define TIM8_CR2_CCDS_B_0X1                 (0x1U<<3U)
#define TIM8_CR2_CCUS_B_0X0                 (0x0U<<2U)
#define TIM8_CR2_CCUS_B_0X1                 (0x1U<<2U)
#define TIM8_CR2_CCPC_B_0X0                 (0x0U<<0U)
#define TIM8_CR2_CCPC_B_0X1                 (0x1U<<0U)

