Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim8.h
// SMCR Configuration

#define TIM8_SMCR_TS_1                      (0x3U<<20U)
#define TIM8_SMCR_TS_1_0                    (0x1U<<20U)
#define TIM8_SMCR_SMS_1                     (0x1U<<16U)
#define TIM8_SMCR_ETP                       (0x1U<<15U)
#define TIM8_SMCR_ECE                       (0x1U<<14U)
#define TIM8_SMCR_ETPS                      (0x3U<<12U)
#define TIM8_SMCR_ETPS_0                    (0x1U<<12U)
#define TIM8_SMCR_ETF                       (0xFU<<8U)
#define TIM8_SMCR_ETF_0                     (0x1U<<8U)
#define TIM8_SMCR_MSM                       (0x1U<<7U)
#define TIM8_SMCR_TS                        (0x7U<<4U)
#define TIM8_SMCR_TS_0                      (0x1U<<4U)
#define TIM8_SMCR_SMS                       (0x7U<<0U)
#define TIM8_SMCR_SMS_0                     (0x1U<<0U)
#define TIM8_SMCR_ETP_B_0X0                 (0x0U<<15U)
#define TIM8_SMCR_ETP_B_0X1                 (0x1U<<15U)
#define TIM8_SMCR_ECE_B_0X0                 (0x0U<<14U)
#define TIM8_SMCR_ECE_B_0X1                 (0x1U<<14U)
#define TIM8_SMCR_ETPS_B_0X0                (0x0U<<12U)
#define TIM8_SMCR_ETPS_B_0X1                (0x1U<<12U)
#define TIM8_SMCR_ETPS_B_0X2                (0x2U<<12U)
#define TIM8_SMCR_ETPS_B_0X3                (0x3U<<12U)
#define TIM8_SMCR_ETF_B_0X0                 (0x0U<<8U)
#define TIM8_SMCR_ETF_B_0X1                 (0x1U<<8U)
#define TIM8_SMCR_ETF_B_0X2                 (0x2U<<8U)
#define TIM8_SMCR_ETF_B_0X3                 (0x3U<<8U)
#define TIM8_SMCR_ETF_B_0X4                 (0x4U<<8U)
#define TIM8_SMCR_ETF_B_0X5                 (0x5U<<8U)
#define TIM8_SMCR_ETF_B_0X6                 (0x6U<<8U)
#define TIM8_SMCR_ETF_B_0X7                 (0x7U<<8U)
#define TIM8_SMCR_ETF_B_0X8                 (0x8U<<8U)
#define TIM8_SMCR_ETF_B_0X9                 (0x9U<<8U)
#define TIM8_SMCR_ETF_B_0XA                 (0xAU<<8U)
#define TIM8_SMCR_ETF_B_0XB                 (0xBU<<8U)
#define TIM8_SMCR_ETF_B_0XC                 (0xCU<<8U)
#define TIM8_SMCR_ETF_B_0XD                 (0xDU<<8U)
#define TIM8_SMCR_ETF_B_0XE                 (0xEU<<8U)
#define TIM8_SMCR_ETF_B_0XF                 (0xFU<<8U)
#define TIM8_SMCR_MSM_B_0X0                 (0x0U<<7U)
#define TIM8_SMCR_MSM_B_0X1                 (0x1U<<7U)
#define TIM8_SMCR_TS_B_0X0                  (0x0U<<4U)
#define TIM8_SMCR_TS_B_0X1                  (0x1U<<4U)
#define TIM8_SMCR_TS_B_0X2                  (0x2U<<4U)
#define TIM8_SMCR_TS_B_0X3                  (0x3U<<4U)
#define TIM8_SMCR_TS_B_0X4                  (0x4U<<4U)
#define TIM8_SMCR_TS_B_0X5                  (0x5U<<4U)
#define TIM8_SMCR_TS_B_0X6                  (0x6U<<4U)
#define TIM8_SMCR_TS_B_0X7                  (0x7U<<4U)
#define TIM8_SMCR_SMS_B_0X0                 (0x0U<<0U)
#define TIM8_SMCR_SMS_B_0X1                 (0x1U<<0U)
#define TIM8_SMCR_SMS_B_0X2                 (0x2U<<0U)
#define TIM8_SMCR_SMS_B_0X3                 (0x3U<<0U)
#define TIM8_SMCR_SMS_B_0X4                 (0x4U<<0U)
#define TIM8_SMCR_SMS_B_0X5                 (0x5U<<0U)
#define TIM8_SMCR_SMS_B_0X6                 (0x6U<<0U)
#define TIM8_SMCR_SMS_B_0X7                 (0x7U<<0U)

// DIER Configuration

#define TIM8_DIER_TDE                       (0x1U<<14U)
#define TIM8_DIER_COMDE                     (0x1U<<13U)
#define TIM8_DIER_CC4DE                     (0x1U<<12U)
#define TIM8_DIER_CC3DE                     (0x1U<<11U)
#define TIM8_DIER_CC2DE                     (0x1U<<10U)
#define TIM8_DIER_CC1DE                     (0x1U<<9U)
#define TIM8_DIER_UDE                       (0x1U<<8U)
#define TIM8_DIER_BIE                       (0x1U<<7U)
#define TIM8_DIER_TIE                       (0x1U<<6U)
#define TIM8_DIER_COMIE                     (0x1U<<5U)
#define TIM8_DIER_CC4IE                     (0x1U<<4U)
#define TIM8_DIER_CC3IE                     (0x1U<<3U)
#define TIM8_DIER_CC2IE                     (0x1U<<2U)
#define TIM8_DIER_CC1IE                     (0x1U<<1U)
#define TIM8_DIER_UIE                       (0x1U<<0U)
#define TIM8_DIER_TDE_B_0X0                 (0x0U<<14U)
#define TIM8_DIER_TDE_B_0X1                 (0x1U<<14U)
#define TIM8_DIER_COMDE_B_0X0               (0x0U<<13U)
#define TIM8_DIER_COMDE_B_0X1               (0x1U<<13U)
#define TIM8_DIER_CC4DE_B_0X0               (0x0U<<12U)
#define TIM8_DIER_CC4DE_B_0X1               (0x1U<<12U)
#define TIM8_DIER_CC3DE_B_0X0               (0x0U<<11U)
#define TIM8_DIER_CC3DE_B_0X1               (0x1U<<11U)
#define TIM8_DIER_CC2DE_B_0X0               (0x0U<<10U)
#define TIM8_DIER_CC2DE_B_0X1               (0x1U<<10U)
#define TIM8_DIER_CC1DE_B_0X0               (0x0U<<9U)
#define TIM8_DIER_CC1DE_B_0X1               (0x1U<<9U)
#define TIM8_DIER_UDE_B_0X0                 (0x0U<<8U)
#define TIM8_DIER_UDE_B_0X1                 (0x1U<<8U)
#define TIM8_DIER_BIE_B_0X0                 (0x0U<<7U)
#define TIM8_DIER_BIE_B_0X1                 (0x1U<<7U)
#define TIM8_DIER_TIE_B_0X0                 (0x0U<<6U)
#define TIM8_DIER_TIE_B_0X1                 (0x1U<<6U)
#define TIM8_DIER_COMIE_B_0X0               (0x0U<<5U)
#define TIM8_DIER_COMIE_B_0X1               (0x1U<<5U)
#define TIM8_DIER_CC4IE_B_0X0               (0x0U<<4U)
#define TIM8_DIER_CC4IE_B_0X1               (0x1U<<4U)
#define TIM8_DIER_CC3IE_B_0X0               (0x0U<<3U)
#define TIM8_DIER_CC3IE_B_0X1               (0x1U<<3U)
#define TIM8_DIER_CC2IE_B_0X0               (0x0U<<2U)
#define TIM8_DIER_CC2IE_B_0X1               (0x1U<<2U)
#define TIM8_DIER_CC1IE_B_0X0               (0x0U<<1U)
#define TIM8_DIER_CC1IE_B_0X1               (0x1U<<1U)
#define TIM8_DIER_UIE_B_0X0                 (0x0U<<0U)
#define TIM8_DIER_UIE_B_0X1                 (0x1U<<0U)

// SR Configuration

#define TIM8_SR_CC6IF                       (0x1U<<17U)
#define TIM8_SR_CC5IF                       (0x1U<<16U)
#define TIM8_SR_SBIF                        (0x1U<<13U)
#define TIM8_SR_CC4OF                       (0x1U<<12U)
#define TIM8_SR_CC3OF                       (0x1U<<11U)
#define TIM8_SR_CC2OF                       (0x1U<<10U)
#define TIM8_SR_CC1OF                       (0x1U<<9U)
#define TIM8_SR_B2IF                        (0x1U<<8U)
#define TIM8_SR_BIF                         (0x1U<<7U)
#define TIM8_SR_TIF                         (0x1U<<6U)
#define TIM8_SR_COMIF                       (0x1U<<5U)
#define TIM8_SR_CC4IF                       (0x1U<<4U)
#define TIM8_SR_CC3IF                       (0x1U<<3U)
#define TIM8_SR_CC2IF                       (0x1U<<2U)
#define TIM8_SR_CC1IF                       (0x1U<<1U)
#define TIM8_SR_UIF                         (0x1U<<0U)
#define TIM8_SR_SBIF_B_0X0                  (0x0U<<13U)
#define TIM8_SR_SBIF_B_0X1                  (0x1U<<13U)
#define TIM8_SR_CC1OF_B_0X0                 (0x0U<<9U)
#define TIM8_SR_CC1OF_B_0X1                 (0x1U<<9U)
#define TIM8_SR_B2IF_B_0X0                  (0x0U<<8U)
#define TIM8_SR_B2IF_B_0X1                  (0x1U<<8U)
#define TIM8_SR_BIF_B_0X0                   (0x0U<<7U)
#define TIM8_SR_BIF_B_0X1                   (0x1U<<7U)
#define TIM8_SR_TIF_B_0X0                   (0x0U<<6U)
#define TIM8_SR_TIF_B_0X1                   (0x1U<<6U)
#define TIM8_SR_COMIF_B_0X0                 (0x0U<<5U)
#define TIM8_SR_COMIF_B_0X1                 (0x1U<<5U)
#define TIM8_SR_CC1IF_B_0X0                 (0x0U<<1U)
#define TIM8_SR_CC1IF_B_0X1                 (0x1U<<1U)
#define TIM8_SR_UIF_B_0X0                   (0x0U<<0U)
#define TIM8_SR_UIF_B_0X1                   (0x1U<<0U)

// EGR Configuration

#define TIM8_EGR_B2G                        (0x1U<<8U)
#define TIM8_EGR_BG                         (0x1U<<7U)
#define TIM8_EGR_TG                         (0x1U<<6U)
#define TIM8_EGR_COMG                       (0x1U<<5U)
#define TIM8_EGR_CC4G                       (0x1U<<4U)
#define TIM8_EGR_CC3G                       (0x1U<<3U)
#define TIM8_EGR_CC2G                       (0x1U<<2U)
#define TIM8_EGR_CC1G                       (0x1U<<1U)
#define TIM8_EGR_UG                         (0x1U<<0U)
#define TIM8_EGR_B2G_B_0X0                  (0x0U<<8U)
#define TIM8_EGR_B2G_B_0X1                  (0x1U<<8U)
#define TIM8_EGR_BG_B_0X0                   (0x0U<<7U)
#define TIM8_EGR_BG_B_0X1                   (0x1U<<7U)
#define TIM8_EGR_TG_B_0X0                   (0x0U<<6U)
#define TIM8_EGR_TG_B_0X1                   (0x1U<<6U)
#define TIM8_EGR_COMG_B_0X0                 (0x0U<<5U)
#define TIM8_EGR_COMG_B_0X1                 (0x1U<<5U)
#define TIM8_EGR_CC1G_B_0X0                 (0x0U<<1U)
#define TIM8_EGR_CC1G_B_0X1                 (0x1U<<1U)
#define TIM8_EGR_UG_B_0X0                   (0x0U<<0U)
#define TIM8_EGR_UG_B_0X1                   (0x1U<<0U)

// CCMR1 Configuration

#define TIM8_CCMR1_IC2F                     (0xFU<<12U)
#define TIM8_CCMR1_IC2F_0                   (0x1U<<12U)
#define TIM8_CCMR1_IC2PSC                   (0x3U<<10U)
#define TIM8_CCMR1_IC2PSC_0                 (0x1U<<10U)
#define TIM8_CCMR1_CC2S                     (0x3U<<8U)
#define TIM8_CCMR1_CC2S_0                   (0x1U<<8U)
#define TIM8_CCMR1_IC1F                     (0xFU<<4U)
#define TIM8_CCMR1_IC1F_0                   (0x1U<<4U)
#define TIM8_CCMR1_IC1PSC                   (0x3U<<2U)
#define TIM8_CCMR1_IC1PSC_0                 (0x1U<<2U)
#define TIM8_CCMR1_CC1S                     (0x3U<<0U)
#define TIM8_CCMR1_CC1S_0                   (0x1U<<0U)
#define TIM8_CCMR1_CC2S_B_0X0               (0x0U<<8U)
#define TIM8_CCMR1_CC2S_B_0X1               (0x1U<<8U)
#define TIM8_CCMR1_CC2S_B_0X2               (0x2U<<8U)
#define TIM8_CCMR1_CC2S_B_0X3               (0x3U<<8U)
#define TIM8_CCMR1_IC1F_B_0X0               (0x0U<<4U)
#define TIM8_CCMR1_IC1F_B_0X1               (0x1U<<4U)
#define TIM8_CCMR1_IC1F_B_0X2               (0x2U<<4U)
#define TIM8_CCMR1_IC1F_B_0X3               (0x3U<<4U)
#define TIM8_CCMR1_IC1F_B_0X4               (0x4U<<4U)
#define TIM8_CCMR1_IC1F_B_0X5               (0x5U<<4U)
#define TIM8_CCMR1_IC1F_B_0X6               (0x6U<<4U)
#define TIM8_CCMR1_IC1F_B_0X7               (0x7U<<4U)
#define TIM8_CCMR1_IC1F_B_0X8               (0x8U<<4U)
#define TIM8_CCMR1_IC1F_B_0X9               (0x9U<<4U)
#define TIM8_CCMR1_IC1F_B_0XA               (0xAU<<4U)
#define TIM8_CCMR1_IC1F_B_0XB               (0xBU<<4U)
#define TIM8_CCMR1_IC1F_B_0XC               (0xCU<<4U)
#define TIM8_CCMR1_IC1F_B_0XD               (0xDU<<4U)
#define TIM8_CCMR1_IC1F_B_0XE               (0xEU<<4U)
#define TIM8_CCMR1_IC1F_B_0XF               (0xFU<<4U)
#define TIM8_CCMR1_IC1PSC_B_0X0             (0x0U<<2U)
#define TIM8_CCMR1_IC1PSC_B_0X1             (0x1U<<2U)
#define TIM8_CCMR1_IC1PSC_B_0X2             (0x2U<<2U)
#define TIM8_CCMR1_IC1PSC_B_0X3             (0x3U<<2U)
#define TIM8_CCMR1_CC1S_B_0X0               (0x0U<<0U)
#define TIM8_CCMR1_CC1S_B_0X1               (0x1U<<0U)
#define TIM8_CCMR1_CC1S_B_0X2               (0x2U<<0U)
#define TIM8_CCMR1_CC1S_B_0X3               (0x3U<<0U)

// CCMR1_ALTERNATE Configuration

#define TIM8_CCMR1_ALTERNATE_OC2M_1         (0x1U<<24U)
#define TIM8_CCMR1_ALTERNATE_OC1M_1         (0x1U<<16U)
#define TIM8_CCMR1_ALTERNATE_OC2CE          (0x1U<<15U)
#define TIM8_CCMR1_ALTERNATE_OC2M           (0x7U<<12U)
#define TIM8_CCMR1_ALTERNATE_OC2M_0         (0x1U<<12U)
#define TIM8_CCMR1_ALTERNATE_OC2PE          (0x1U<<11U)
#define TIM8_CCMR1_ALTERNATE_OC2FE          (0x1U<<10U)
#define TIM8_CCMR1_ALTERNATE_CC2S           (0x3U<<8U)
#define TIM8_CCMR1_ALTERNATE_CC2S_0         (0x1U<<8U)
#define TIM8_CCMR1_ALTERNATE_OC1CE          (0x1U<<7U)
#define TIM8_CCMR1_ALTERNATE_OC1M           (0x7U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_0         (0x1U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1PE          (0x1U<<3U)
#define TIM8_CCMR1_ALTERNATE_OC1FE          (0x1U<<2U)
#define TIM8_CCMR1_ALTERNATE_CC1S           (0x3U<<0U)
#define TIM8_CCMR1_ALTERNATE_CC1S_0         (0x1U<<0U)
#define TIM8_CCMR1_ALTERNATE_CC2S_B_0X0     (0x0U<<8U)
#define TIM8_CCMR1_ALTERNATE_CC2S_B_0X1     (0x1U<<8U)
#define TIM8_CCMR1_ALTERNATE_CC2S_B_0X2     (0x2U<<8U)
#define TIM8_CCMR1_ALTERNATE_CC2S_B_0X3     (0x3U<<8U)
#define TIM8_CCMR1_ALTERNATE_OC1CE_B_0X0    (0x0U<<7U)
#define TIM8_CCMR1_ALTERNATE_OC1CE_B_0X1    (0x1U<<7U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X0     (0x0U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X1     (0x1U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X2     (0x2U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X3     (0x3U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X4     (0x4U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X5     (0x5U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X6     (0x6U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1M_B_0X7     (0x7U<<4U)
#define TIM8_CCMR1_ALTERNATE_OC1PE_B_0X0    (0x0U<<3U)
#define TIM8_CCMR1_ALTERNATE_OC1PE_B_0X1    (0x1U<<3U)
#define TIM8_CCMR1_ALTERNATE_OC1FE_B_0X0    (0x0U<<2U)
#define TIM8_CCMR1_ALTERNATE_OC1FE_B_0X1    (0x1U<<2U)
#define TIM8_CCMR1_ALTERNATE_CC1S_B_0X0     (0x0U<<0U)
#define TIM8_CCMR1_ALTERNATE_CC1S_B_0X1     (0x1U<<0U)
#define TIM8_CCMR1_ALTERNATE_CC1S_B_0X2     (0x2U<<0U)
#define TIM8_CCMR1_ALTERNATE_CC1S_B_0X3     (0x3U<<0U)

