Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim8.h
// CCMR2 Configuration

#define TIM8_CCMR2_IC4F                     (0xFU<<12U)
#define TIM8_CCMR2_IC4F_0                   (0x1U<<12U)
#define TIM8_CCMR2_IC4PSC                   (0x3U<<10U)
#define TIM8_CCMR2_IC4PSC_0                 (0x1U<<10U)
#define TIM8_CCMR2_CC4S                     (0x3U<<8U)
#define TIM8_CCMR2_CC4S_0                   (0x1U<<8U)
#define TIM8_CCMR2_IC3F                     (0xFU<<4U)
#define TIM8_CCMR2_IC3F_0                   (0x1U<<4U)
#define TIM8_CCMR2_IC3PSC                   (0x3U<<2U)
#define TIM8_CCMR2_IC3PSC_0                 (0x1U<<2U)
#define TIM8_CCMR2_CC3S                     (0x3U<<0U)
#define TIM8_CCMR2_CC3S_0                   (0x1U<<0U)
#define TIM8_CCMR2_CC4S_B_0X0               (0x0U<<8U)
#define TIM8_CCMR2_CC4S_B_0X1               (0x1U<<8U)
#define TIM8_CCMR2_CC4S_B_0X2               (0x2U<<8U)
#define TIM8_CCMR2_CC4S_B_0X3               (0x3U<<8U)
#define TIM8_CCMR2_CC3S_B_0X0               (0x0U<<0U)
#define TIM8_CCMR2_CC3S_B_0X1               (0x1U<<0U)
#define TIM8_CCMR2_CC3S_B_0X2               (0x2U<<0U)
#define TIM8_CCMR2_CC3S_B_0X3               (0x3U<<0U)

// CCMR2_ALTERNATE Configuration

#define TIM8_CCMR2_ALTERNATE_OC4M_1         (0x1U<<24U)
#define TIM8_CCMR2_ALTERNATE_OC3M_1         (0x1U<<16U)
#define TIM8_CCMR2_ALTERNATE_OC4CE          (0x1U<<15U)
#define TIM8_CCMR2_ALTERNATE_OC4M           (0x7U<<12U)
#define TIM8_CCMR2_ALTERNATE_OC4M_0         (0x1U<<12U)
#define TIM8_CCMR2_ALTERNATE_OC4PE          (0x1U<<11U)
#define TIM8_CCMR2_ALTERNATE_OC4FE          (0x1U<<10U)
#define TIM8_CCMR2_ALTERNATE_CC4S           (0x3U<<8U)
#define TIM8_CCMR2_ALTERNATE_CC4S_0         (0x1U<<8U)
#define TIM8_CCMR2_ALTERNATE_OC3CE          (0x1U<<7U)
#define TIM8_CCMR2_ALTERNATE_OC3M           (0x7U<<4U)
#define TIM8_CCMR2_ALTERNATE_OC3M_0         (0x1U<<4U)
#define TIM8_CCMR2_ALTERNATE_OC3PE          (0x1U<<3U)
#define TIM8_CCMR2_ALTERNATE_OC3FE          (0x1U<<2U)
#define TIM8_CCMR2_ALTERNATE_CC3S           (0x3U<<0U)
#define TIM8_CCMR2_ALTERNATE_CC3S_0         (0x1U<<0U)
#define TIM8_CCMR2_ALTERNATE_CC4S_B_0X0     (0x0U<<8U)
#define TIM8_CCMR2_ALTERNATE_CC4S_B_0X1     (0x1U<<8U)
#define TIM8_CCMR2_ALTERNATE_CC4S_B_0X2     (0x2U<<8U)
#define TIM8_CCMR2_ALTERNATE_CC4S_B_0X3     (0x3U<<8U)
#define TIM8_CCMR2_ALTERNATE_CC3S_B_0X0     (0x0U<<0U)
#define TIM8_CCMR2_ALTERNATE_CC3S_B_0X1     (0x1U<<0U)
#define TIM8_CCMR2_ALTERNATE_CC3S_B_0X2     (0x2U<<0U)
#define TIM8_CCMR2_ALTERNATE_CC3S_B_0X3     (0x3U<<0U)

// CCER Configuration

#define TIM8_CCER_CC6P                      (0x1U<<21U)
#define TIM8_CCER_CC6E                      (0x1U<<20U)
#define TIM8_CCER_CC5P                      (0x1U<<17U)
#define TIM8_CCER_CC5E                      (0x1U<<16U)
#define TIM8_CCER_CC4NP                     (0x1U<<15U)
#define TIM8_CCER_CC4P                      (0x1U<<13U)
#define TIM8_CCER_CC4E                      (0x1U<<12U)
#define TIM8_CCER_CC3NP                     (0x1U<<11U)
#define TIM8_CCER_CC3NE                     (0x1U<<10U)
#define TIM8_CCER_CC3P                      (0x1U<<9U)
#define TIM8_CCER_CC3E                      (0x1U<<8U)
#define TIM8_CCER_CC2NP                     (0x1U<<7U)
#define TIM8_CCER_CC2NE                     (0x1U<<6U)
#define TIM8_CCER_CC2P                      (0x1U<<5U)
#define TIM8_CCER_CC2E                      (0x1U<<4U)
#define TIM8_CCER_CC1NP                     (0x1U<<3U)
#define TIM8_CCER_CC1NE                     (0x1U<<2U)
#define TIM8_CCER_CC1P                      (0x1U<<1U)
#define TIM8_CCER_CC1E                      (0x1U<<0U)
#define TIM8_CCER_CC1NP_B_0X0               (0x0U<<3U)
#define TIM8_CCER_CC1NP_B_0X1               (0x1U<<3U)
#define TIM8_CCER_CC1NE_B_0X0               (0x0U<<2U)
#define TIM8_CCER_CC1NE_B_0X1               (0x1U<<2U)
#define TIM8_CCER_CC1P_B_0X0                (0x0U<<1U)
#define TIM8_CCER_CC1P_B_0X1                (0x1U<<1U)
#define TIM8_CCER_CC1E_B_0X0                (0x0U<<0U)
#define TIM8_CCER_CC1E_B_0X1                (0x1U<<0U)

// CNT Configuration

#define TIM8_CNT_UIFCPY                     (0x1U<<31U)
#define TIM8_CNT_CNT                        (0xFFFFU<<0U)
#define TIM8_CNT_CNT_0                      (0x1U<<0U)

// PSC Configuration

#define TIM8_PSC_PSC                        (0xFFFFU<<0U)
#define TIM8_PSC_PSC_0                      (0x1U<<0U)

// ARR Configuration

#define TIM8_ARR_ARR                        (0xFFFFU<<0U)
#define TIM8_ARR_ARR_0                      (0x1U<<0U)

// RCR Configuration

#define TIM8_RCR_REP                        (0xFFFFU<<0U)
#define TIM8_RCR_REP_0                      (0x1U<<0U)

// CCR1 Configuration

#define TIM8_CCR1_CCR1                      (0xFFFFU<<0U)
#define TIM8_CCR1_CCR1_0                    (0x1U<<0U)

// CCR2 Configuration

#define TIM8_CCR2_CCR2                      (0xFFFFU<<0U)
#define TIM8_CCR2_CCR2_0                    (0x1U<<0U)

// CCR3 Configuration

#define TIM8_CCR3_CCR3                      (0xFFFFU<<0U)
#define TIM8_CCR3_CCR3_0                    (0x1U<<0U)

// CCR4 Configuration

#define TIM8_CCR4_CCR4                      (0xFFFFU<<0U)
#define TIM8_CCR4_CCR4_0                    (0x1U<<0U)

// BDTR Configuration

#define TIM8_BDTR_BK2P                      (0x1U<<25U)
#define TIM8_BDTR_BK2E                      (0x1U<<24U)
#define TIM8_BDTR_BK2F                      (0xFU<<20U)
#define TIM8_BDTR_BK2F_0                    (0x1U<<20U)
#define TIM8_BDTR_BKF                       (0xFU<<16U)
#define TIM8_BDTR_BKF_0                     (0x1U<<16U)
#define TIM8_BDTR_MOE                       (0x1U<<15U)
#define TIM8_BDTR_AOE                       (0x1U<<14U)
#define TIM8_BDTR_BKP                       (0x1U<<13U)
#define TIM8_BDTR_BKE                       (0x1U<<12U)
#define TIM8_BDTR_OSSR                      (0x1U<<11U)
#define TIM8_BDTR_OSSI                      (0x1U<<10U)
#define TIM8_BDTR_LOCK                      (0x3U<<8U)
#define TIM8_BDTR_LOCK_0                    (0x1U<<8U)
#define TIM8_BDTR_DTG                       (0xFFU<<0U)
#define TIM8_BDTR_DTG_0                     (0x1U<<0U)
#define TIM8_BDTR_BK2P_B_0X0                (0x0U<<25U)
#define TIM8_BDTR_BK2P_B_0X1                (0x1U<<25U)
#define TIM8_BDTR_BK2E_B_0X0                (0x0U<<24U)
#define TIM8_BDTR_BK2E_B_0X1                (0x1U<<24U)
#define TIM8_BDTR_BK2F_B_0X0                (0x0U<<20U)
#define TIM8_BDTR_BK2F_B_0X1                (0x1U<<20U)
#define TIM8_BDTR_BK2F_B_0X2                (0x2U<<20U)
#define TIM8_BDTR_BK2F_B_0X3                (0x3U<<20U)
#define TIM8_BDTR_BK2F_B_0X4                (0x4U<<20U)
#define TIM8_BDTR_BK2F_B_0X5                (0x5U<<20U)
#define TIM8_BDTR_BK2F_B_0X6                (0x6U<<20U)
#define TIM8_BDTR_BK2F_B_0X7                (0x7U<<20U)
#define TIM8_BDTR_BK2F_B_0X8                (0x8U<<20U)
#define TIM8_BDTR_BK2F_B_0X9                (0x9U<<20U)
#define TIM8_BDTR_BK2F_B_0XA                (0xAU<<20U)
#define TIM8_BDTR_BK2F_B_0XB                (0xBU<<20U)
#define TIM8_BDTR_BK2F_B_0XC                (0xCU<<20U)
#define TIM8_BDTR_BK2F_B_0XD                (0xDU<<20U)
#define TIM8_BDTR_BK2F_B_0XE                (0xEU<<20U)
#define TIM8_BDTR_BK2F_B_0XF                (0xFU<<20U)
#define TIM8_BDTR_BKF_B_0X0                 (0x0U<<16U)
#define TIM8_BDTR_BKF_B_0X1                 (0x1U<<16U)
#define TIM8_BDTR_BKF_B_0X2                 (0x2U<<16U)
#define TIM8_BDTR_BKF_B_0X3                 (0x3U<<16U)
#define TIM8_BDTR_BKF_B_0X4                 (0x4U<<16U)
#define TIM8_BDTR_BKF_B_0X5                 (0x5U<<16U)
#define TIM8_BDTR_BKF_B_0X6                 (0x6U<<16U)
#define TIM8_BDTR_BKF_B_0X7                 (0x7U<<16U)
#define TIM8_BDTR_BKF_B_0X8                 (0x8U<<16U)
#define TIM8_BDTR_BKF_B_0X9                 (0x9U<<16U)
#define TIM8_BDTR_BKF_B_0XA                 (0xAU<<16U)
#define TIM8_BDTR_BKF_B_0XB                 (0xBU<<16U)
#define TIM8_BDTR_BKF_B_0XC                 (0xCU<<16U)
#define TIM8_BDTR_BKF_B_0XD                 (0xDU<<16U)
#define TIM8_BDTR_BKF_B_0XE                 (0xEU<<16U)
#define TIM8_BDTR_BKF_B_0XF                 (0xFU<<16U)
#define TIM8_BDTR_MOE_B_0X0                 (0x0U<<15U)
#define TIM8_BDTR_MOE_B_0X1                 (0x1U<<15U)
#define TIM8_BDTR_AOE_B_0X0                 (0x0U<<14U)
#define TIM8_BDTR_AOE_B_0X1                 (0x1U<<14U)
#define TIM8_BDTR_BKP_B_0X0                 (0x0U<<13U)
#define TIM8_BDTR_BKP_B_0X1                 (0x1U<<13U)
#define TIM8_BDTR_BKE_B_0X0                 (0x0U<<12U)
#define TIM8_BDTR_BKE_B_0X1                 (0x1U<<12U)
#define TIM8_BDTR_OSSR_B_0X0                (0x0U<<11U)
#define TIM8_BDTR_OSSR_B_0X1                (0x1U<<11U)
#define TIM8_BDTR_OSSI_B_0X0                (0x0U<<10U)
#define TIM8_BDTR_OSSI_B_0X1                (0x1U<<10U)
#define TIM8_BDTR_LOCK_B_0X0                (0x0U<<8U)
#define TIM8_BDTR_LOCK_B_0X1                (0x1U<<8U)
#define TIM8_BDTR_LOCK_B_0X2                (0x2U<<8U)
#define TIM8_BDTR_LOCK_B_0X3                (0x3U<<8U)

// DCR Configuration

