Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim8.h
#define TIM8_DCR_DBL                        (0x1FU<<8U)
#define TIM8_DCR_DBL_0                      (0x1U<<8U)
#define TIM8_DCR_DBA                        (0x1FU<<0U)
#define TIM8_DCR_DBA_0                      (0x1U<<0U)
#define TIM8_DCR_DBL_B_0X0                  (0x0U<<8U)
#define TIM8_DCR_DBL_B_0X1                  (0x1U<<8U)
#define TIM8_DCR_DBL_B_0X2                  (0x2U<<8U)
#define TIM8_DCR_DBL_B_0X11                 (0x11U<<8U)
#define TIM8_DCR_DBA_B_0X0                  (0x0U<<0U)
#define TIM8_DCR_DBA_B_0X1                  (0x1U<<0U)
#define TIM8_DCR_DBA_B_0X2                  (0x2U<<0U)

// DMAR Configuration

#define TIM8_DMAR_DMAB                      (0xFFFFFFFFU<<0U)
#define TIM8_DMAR_DMAB_0                    (0x1U<<0U)

// CCMR3 Configuration

#define TIM8_CCMR3_OC6M_1                   (0x1U<<24U)
#define TIM8_CCMR3_OC5M_1                   (0x1U<<16U)
#define TIM8_CCMR3_OC6CE                    (0x1U<<15U)
#define TIM8_CCMR3_OC6M                     (0x7U<<12U)
#define TIM8_CCMR3_OC6M_0                   (0x1U<<12U)
#define TIM8_CCMR3_OC6PE                    (0x1U<<11U)
#define TIM8_CCMR3_OC6FE                    (0x1U<<10U)
#define TIM8_CCMR3_OC5CE                    (0x1U<<7U)
#define TIM8_CCMR3_OC5M                     (0x7U<<4U)
#define TIM8_CCMR3_OC5M_0                   (0x1U<<4U)
#define TIM8_CCMR3_OC5PE                    (0x1U<<3U)
#define TIM8_CCMR3_OC5FE                    (0x1U<<2U)

// CCR5 Configuration

#define TIM8_CCR5_GC5C3                     (0x1U<<31U)
#define TIM8_CCR5_GC5C2                     (0x1U<<30U)
#define TIM8_CCR5_GC5C1                     (0x1U<<29U)
#define TIM8_CCR5_CCR5                      (0xFFFFU<<0U)
#define TIM8_CCR5_CCR5_0                    (0x1U<<0U)
#define TIM8_CCR5_GC5C3_B_0X0               (0x0U<<31U)
#define TIM8_CCR5_GC5C3_B_0X1               (0x1U<<31U)
#define TIM8_CCR5_GC5C2_B_0X0               (0x0U<<30U)
#define TIM8_CCR5_GC5C2_B_0X1               (0x1U<<30U)
#define TIM8_CCR5_GC5C1_B_0X0               (0x0U<<29U)
#define TIM8_CCR5_GC5C1_B_0X1               (0x1U<<29U)

// CCR6 Configuration

#define TIM8_CCR6_CCR6                      (0xFFFFU<<0U)
#define TIM8_CCR6_CCR6_0                    (0x1U<<0U)

// AF1 Configuration

#define TIM8_AF1_ETRSEL                     (0xFU<<14U)
#define TIM8_AF1_ETRSEL_0                   (0x1U<<14U)
#define TIM8_AF1_BKCMP2P                    (0x1U<<11U)
#define TIM8_AF1_BKCMP1P                    (0x1U<<10U)
#define TIM8_AF1_BKINP                      (0x1U<<9U)
#define TIM8_AF1_BKDF1BK2E                  (0x1U<<8U)
#define TIM8_AF1_BKCMP2E                    (0x1U<<2U)
#define TIM8_AF1_BKCMP1E                    (0x1U<<1U)
#define TIM8_AF1_BKINE                      (0x1U<<0U)
#define TIM8_AF1_ETRSEL_B_0X0               (0x0U<<14U)
#define TIM8_AF1_ETRSEL_B_0X1               (0x1U<<14U)
#define TIM8_AF1_ETRSEL_B_0X2               (0x2U<<14U)
#define TIM8_AF1_ETRSEL_B_0X3               (0x3U<<14U)
#define TIM8_AF1_ETRSEL_B_0X4               (0x4U<<14U)
#define TIM8_AF1_ETRSEL_B_0X5               (0x5U<<14U)
#define TIM8_AF1_ETRSEL_B_0X6               (0x6U<<14U)
#define TIM8_AF1_ETRSEL_B_0X7               (0x7U<<14U)
#define TIM8_AF1_ETRSEL_B_0X8               (0x8U<<14U)
#define TIM8_AF1_BKCMP2P_B_0X0              (0x0U<<11U)
#define TIM8_AF1_BKCMP2P_B_0X1              (0x1U<<11U)
#define TIM8_AF1_BKCMP1P_B_0X0              (0x0U<<10U)
#define TIM8_AF1_BKCMP1P_B_0X1              (0x1U<<10U)
#define TIM8_AF1_BKINP_B_0X0                (0x0U<<9U)
#define TIM8_AF1_BKINP_B_0X1                (0x1U<<9U)
#define TIM8_AF1_BKDF1BK2E_B_0X0            (0x0U<<8U)
#define TIM8_AF1_BKDF1BK2E_B_0X1            (0x1U<<8U)
#define TIM8_AF1_BKCMP2E_B_0X0              (0x0U<<2U)
#define TIM8_AF1_BKCMP2E_B_0X1              (0x1U<<2U)
#define TIM8_AF1_BKCMP1E_B_0X0              (0x0U<<1U)
#define TIM8_AF1_BKCMP1E_B_0X1              (0x1U<<1U)
#define TIM8_AF1_BKINE_B_0X0                (0x0U<<0U)
#define TIM8_AF1_BKINE_B_0X1                (0x1U<<0U)

// AF2 Configuration

#define TIM8_AF2_BK2CMP2P                   (0x1U<<11U)
#define TIM8_AF2_BK2CMP1P                   (0x1U<<10U)
#define TIM8_AF2_BK2INP                     (0x1U<<9U)
#define TIM8_AF2_BK2DF1BK3E                 (0x1U<<8U)
#define TIM8_AF2_BK2CMP2E                   (0x1U<<2U)
#define TIM8_AF2_BK2CMP1E                   (0x1U<<1U)
#define TIM8_AF2_BK2INE                     (0x1U<<0U)
#define TIM8_AF2_BK2CMP2P_B_0X0             (0x0U<<11U)
#define TIM8_AF2_BK2CMP2P_B_0X1             (0x1U<<11U)
#define TIM8_AF2_BK2CMP1P_B_0X0             (0x0U<<10U)
#define TIM8_AF2_BK2CMP1P_B_0X1             (0x1U<<10U)
#define TIM8_AF2_BK2INP_B_0X0               (0x0U<<9U)
#define TIM8_AF2_BK2INP_B_0X1               (0x1U<<9U)
#define TIM8_AF2_BK2DF1BK3E_B_0X0           (0x0U<<8U)
#define TIM8_AF2_BK2DF1BK3E_B_0X1           (0x1U<<8U)
#define TIM8_AF2_BK2CMP2E_B_0X0             (0x0U<<2U)
#define TIM8_AF2_BK2CMP2E_B_0X1             (0x1U<<2U)
#define TIM8_AF2_BK2CMP1E_B_0X0             (0x0U<<1U)
#define TIM8_AF2_BK2CMP1E_B_0X1             (0x1U<<1U)
#define TIM8_AF2_BK2INE_B_0X0               (0x0U<<0U)
#define TIM8_AF2_BK2INE_B_0X1               (0x1U<<0U)

// TISEL Configuration

#define TIM8_TISEL_TI4SEL                   (0xFU<<24U)
#define TIM8_TISEL_TI4SEL_0                 (0x1U<<24U)
#define TIM8_TISEL_TI3SEL                   (0xFU<<16U)
#define TIM8_TISEL_TI3SEL_0                 (0x1U<<16U)
#define TIM8_TISEL_TI2SEL                   (0xFU<<8U)
#define TIM8_TISEL_TI2SEL_0                 (0x1U<<8U)
#define TIM8_TISEL_TI1SEL                   (0xFU<<0U)
#define TIM8_TISEL_TI1SEL_0                 (0x1U<<0U)
#define TIM8_TISEL_TI4SEL_B_0X0             (0x0U<<24U)
#define TIM8_TISEL_TI3SEL_B_0X0             (0x0U<<16U)
#define TIM8_TISEL_TI2SEL_B_0X0             (0x0U<<8U)
#define TIM8_TISEL_TI1SEL_B_0X0             (0x0U<<0U)
#define TIM8_TISEL_TI1SEL_B_0X1             (0x1U<<0U)
